svia3/sensor_collector_energia_compiler_testing/application/Energia/variants/CC1312R1_LAUNCHXL/Board_init.c
/*
 *  ========================== SPI DMA ===================================
*/

/* Include drivers */
#include <ti/drivers/spi/SPICC26XXDMA.h>

/* SPICC26XXDMA functions */
extern void SPICC26XXDMA_close(SPI_Handle handle);
extern int_fast16_t SPICC26XXDMA_control(SPI_Handle handle, uint_fast16_t cmd, void *arg);
extern void SPICC26XXDMA_init(SPI_Handle handle);
extern SPI_Handle SPICC26XXDMA_open(SPI_Handle handle, SPI_Params *params);
extern bool SPICC26XXDMA_transfer(SPI_Handle handle, SPI_Transaction *transaction);
extern void SPICC26XXDMA_transferCancel(SPI_Handle handle);

/* SPI function table for SPICC26XXDMA implementation */
const SPI_FxnTable mySPICC26XXDMA_fxnTable = {
    SPICC26XXDMA_close,
    NULL, /* SPICC26XXDMA_control, */
    SPICC26XXDMA_init,
    SPICC26XXDMA_open,
    SPICC26XXDMA_transfer,
    NULL /* SPICC26XXDMA_transferCancel */
};

/* SPI objects */

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC1312R1_LAUNCHXL_SPICOUNT];

/* SPI configuration structure, describing which pins are to be used */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC1312R1_LAUNCHXL_SPICOUNT] = {
    {   /* CC1312R1_LAUNCHXL_SPI0 */
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,   /* <driverlib>/inc/hw_ints.h */
        .intPriority        = 0xC0,       /* make SPI interrupt one priority higher than default */
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = Board_SPI0_MOSI,
        .misoPin            = Board_SPI0_MISO,
        .clkPin             = Board_SPI0_CLK,
        .csnPin             = PIN_UNASSIGNED,    /* External flash / DevPk uses SPI0 */
        .minDmaTransferSize = 16
    }
};

/* SPI configuration structure */
const SPI_Config SPI_config[] = {
    /* CC1312R1_LAUNCHXL_SPI0 */
    {
        .fxnTablePtr = &mySPICC26XXDMA_fxnTable, 
        .object      = &spiCC26XXDMAObjects[0], 
        .hwAttrs     = &spiCC26XXDMAHWAttrs[0]
    },
};

const uint_least8_t SPI_count = CC1312R1_LAUNCHXL_SPICOUNT;

/*
 *  ============================= UART ===================================
*/

/* Include drivers */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26X2.h>


extern void UARTCC26X2_close(UART_Handle handle);
extern int_fast16_t UARTCC26X2_control(UART_Handle handle, uint_fast16_t cmd,
        void *arg);
extern void UARTCC26X2_init(UART_Handle handle);
extern UART_Handle UARTCC26X2_open(UART_Handle handle, UART_Params *params);
extern int_fast32_t UARTCC26X2_read(UART_Handle handle, void *buffer, size_t size);
extern void UARTCC26X2_readCancel(UART_Handle handle);
extern int_fast32_t UARTCC26X2_readPolling(UART_Handle handle, void *buffer,
        size_t size);
extern int_fast32_t UARTCC26X2_write(UART_Handle handle, const void *buffer,
        size_t size);
extern void UARTCC26X2_writeCancel(UART_Handle handle);
extern int_fast32_t UARTCC26X2_writePolling(UART_Handle handle, const void *buffer,
        size_t size);

/* UART function table for UARTMP432 implementation */
const UART_FxnTable myUARTCC26X2_fxnTable = {
    UARTCC26X2_close,
    UARTCC26X2_control,
    UARTCC26X2_init,
    UARTCC26X2_open,
    UARTCC26X2_read,
    NULL, /* UARTCC26X2_readPolling, */
    NULL, /* UARTCC26X2_readCancel, */
    UARTCC26X2_write,
    NULL, /* UARTCC26XX_writePolling, */
    NULL /* UARTCC26XX_writeCancel, */
};

/* UART objects */
UARTCC26X2_Object uartCC26X2Objects[CC1312R1_LAUNCHXL_UARTCOUNT];
unsigned char uartCC26X2RingBuffer[CC1312R1_LAUNCHXL_UARTCOUNT][32];

/* UART hardware parameter structure, also used to assign UART pins */
const UARTCC26X2_HWAttrs uartCC26X2HWAttrs[CC1312R1_LAUNCHXL_UARTCOUNT] = {
    {   /* CC1312R1_LAUNCHXL_UART0 */
        .baseAddr = UART0_BASE,
        .intNum = INT_UART0_COMB,    /* <driverlib>/inc/hw_ints.h */
        .intPriority = (0xc0),
        .swiPriority = 0,
        .txPin = Board_UART_TX,
        .rxPin = Board_UART_RX,
        .ctsPin = PIN_UNASSIGNED,
        .rtsPin = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26X2RingBuffer[0],
        .ringBufSize    = sizeof(uartCC26X2RingBuffer[0]),
        .txIntFifoThr   = UARTCC26X2_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26X2_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    },
};

/* UART configuration structure */
const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &myUARTCC26X2_fxnTable,
        .object      = &uartCC26X2Objects[0],
        .hwAttrs     = &uartCC26X2HWAttrs[0]
    },
};

const uint_least8_t UART_count = CC1312R1_LAUNCHXL_UARTCOUNT;

/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[1];

const UDMACC26XX_HWAttrs udmaHWAttrs[1] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[1] = {
    {
         .object  = &udmaObjects[0],
         .hwAttrs = &udmaHWAttrs[0]
    },
};

/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogCC26XX.h>

WatchdogCC26XX_Object watchdogCC26XXObjects[1];

const WatchdogCC26XX_HWAttrs watchdogCC26XXHWAttrs[1] = {
    {
        .baseAddr    = WDT_BASE,
        .reloadValue = 1000 /* Reload value in milliseconds */
    },
};

const Watchdog_Config Watchdog_config[1] = {
    {
        .fxnTablePtr = &WatchdogCC26XX_fxnTable,
        .object      = &watchdogCC26XXObjects[0],
        .hwAttrs     = &watchdogCC26XXHWAttrs[0]
    },
};

const uint_least8_t Watchdog_count = 1;

/*
 *  ======== Board_initPIN ========
 */
void Board_initPIN()
{
    PIN_init(BoardGpioInitTable);
}

static Power_NotifyObj energiaNotifyObject;
extern void energiaTimeSync(void);

/*
 *  ======== Board_initPower ========
 */
void Board_initPower(void)
{
    Power_init();

    /*
     * resync micros() and millis() time bases after
     * clock to SysTick has been cut while in deep sleep
     */
    Power_registerNotify(&energiaNotifyObject, PowerCC26XX_AWAKE_STANDBY,
                         (Power_NotifyFxn)energiaTimeSync, (uintptr_t)NULL);
}

/*
 *  ======== Board_init ========
 */
void Board_init(void)
{
    /* driver-independent initialization */

    /* driver-specific initialization */
    Board_initPower();
    Board_initPIN();
    GPIO_init();
}
